<template>
  <div class="example-page">
    <div class="line">
      <xin-label>基础展示（值：{{active}}）</xin-label>
      <xin-tabs
        :list="list"
        itemValue="name"
        itemLabel="title"
        v-model="active"
        @tab-change="tabChange"
      >
        <p slot="yuxiangrousi">
          鱼香肉丝（Yuxiang shredded pork），是四川的一道特色名菜，该菜品以泡辣椒、子姜、大蒜、糖和醋炒制猪里脊肉丝而成，由民国时期的一位川菜大厨所创制，相传灵感来自泡椒肉丝。
          鱼香肉丝是一道著名川菜，其咸鲜酸甜兼备，葱姜蒜香浓郁，其味是调味品调制而成，此法源出于四川民间独具特色的烹鱼调味方法，而今已广泛用于川味的熟菜中。
        </p>
        <p slot="songshuguiyu">
          松鼠鳜鱼，又名松鼠桂鱼，为苏帮菜中色香味兼具的代表之作 [1-2]  ，相传乾隆皇帝下江南，微服至苏州松鹤楼菜馆用膳，厨师用鲤鱼出骨，在鱼肉上刻花纹，加调味稍腌后，拖上蛋黄糊，入热油锅嫩炸成熟后，浇上熬热的糖醋卤汁，形状似鼠，外脆里嫩，酸甜可口，乾隆皇帝吃后很满意，后名扬苏州 [3]  。
        </p>
        <p slot="qingzhengluyu">
          清蒸鲈鱼的烹饪技巧以蒸菜为主，口味属于清淡。清蒸鲈鱼是广东省特色传统名菜之一。属于粤菜系，海鲜菜谱之一，以鲈鱼为制作主料，清蒸鲈鱼的烹饪技巧以蒸菜为主，口味属于咸鲜。
          鲈鱼富含多种营养价值，是淡水鱼中含DHA量最高的，因此清蒸鲈鱼最补脑。选用一斤左右的鲈鱼，蒸的时间恰到火候，鱼肉刚熟，细嫩爽滑，鱼肉的鲜美完全的呈现。汤汁带着米酒的甜，豉油的香，吃到嘴里绝对每一口都是享受。
        </p>
        <p slot="gongbaojiding">
          宫爆鸡丁，又称宫保鸡丁，是川菜中最具代表性的菜品之一。创始人为贵州织金人时任四川总督丁宝桢。其在任四川总督时创制该菜，流传下来。由于一般认为宫保鸡丁正式创制是丁宝桢任四川总督之时，在蜀地创制并流传开，且其后的漫长岁月中，宫保鸡丁主要通过市场巨大的川菜馆作为载体走向大江南北及海外，声名远播，因此宫保鸡丁在菜系定位属于川菜系，同时由于丁宝桢为贵州人，所以宫保鸡丁也可被认为是贵州菜系即黔菜系。
        </p>
        <p slot="mapodoufu">
          麻婆豆腐（拼音：má pó dòu fǔ；英文：sauteed tofu in hot and spicy sauce），是四川省传统名菜之一，属于川菜，主料为：豆腐，辅料为：蒜苗、牛肉沫(其他肉也可以)，调料为：豆瓣、辣椒面和花椒面、酱油、生抽、老抽、糖、淀粉等，麻来自花椒，辣来自辣椒面，此菜成菜麻、辣、鲜、香、烫、翠、嫩、酥，将川菜麻辣味型的特点展现的淋漓尽致，如今，麻婆豆腐远渡重洋，在美国、加拿大、英国、法国、越南、新加坡、马来西亚、日本、澳大利亚等国安家落户，从一味家常小菜一跃而登上大雅之堂，成了国际名菜。
        </p>
        <p slot="xihucuyu">
          西湖醋鱼（West Lake Fish in Vinegar Gravy），又名“叔嫂传珍”“宋嫂鱼”，前身为“宋嫂鱼羹”，是中国浙江省杭州市传统风味名菜，为浙江菜系 [1]  。
          西湖醋鱼主以草鱼等食材用料烹制，色泽红亮，肉质鲜嫩，酸甜清香，口感软嫩，带有蟹味 [2]  。
          2018年9月10日，西湖醋鱼被评为浙江省十大经典名菜之一 [3]  。
        </p>
      </xin-tabs>
    </div>
    <div class="line">
      <xin-label>基础展示（值：{{active1}}）</xin-label>
      <xin-tabs
        :list="list1"
        itemValue="name"
        itemLabel="title"
        v-model="active1"
        @tab-change="tabChange1"
      >
        <p :slot="1">
          Tabs 1
        </p>
        <p :slot="2">
          Tabs 2
        </p>
      </xin-tabs>
    </div>
    <div class="line">
      <xin-label>其他样式展示：蓝色</xin-label>
      <xin-tabs
        :list="list"
        itemValue="name"
        itemLabel="title"
        v-model="active"
        color="info"
        @tab-change="tabChange"
      >
        <p slot="yuxiangrousi">
          鱼香肉丝（Yuxiang shredded pork），是四川的一道特色名菜，该菜品以泡辣椒、子姜、大蒜、糖和醋炒制猪里脊肉丝而成，由民国时期的一位川菜大厨所创制，相传灵感来自泡椒肉丝。
          鱼香肉丝是一道著名川菜，其咸鲜酸甜兼备，葱姜蒜香浓郁，其味是调味品调制而成，此法源出于四川民间独具特色的烹鱼调味方法，而今已广泛用于川味的熟菜中。
        </p>
        <p slot="songshuguiyu">
          松鼠鳜鱼，又名松鼠桂鱼，为苏帮菜中色香味兼具的代表之作 [1-2]  ，相传乾隆皇帝下江南，微服至苏州松鹤楼菜馆用膳，厨师用鲤鱼出骨，在鱼肉上刻花纹，加调味稍腌后，拖上蛋黄糊，入热油锅嫩炸成熟后，浇上熬热的糖醋卤汁，形状似鼠，外脆里嫩，酸甜可口，乾隆皇帝吃后很满意，后名扬苏州 [3]  。
        </p>
        <p slot="qingzhengluyu">
          清蒸鲈鱼的烹饪技巧以蒸菜为主，口味属于清淡。清蒸鲈鱼是广东省特色传统名菜之一。属于粤菜系，海鲜菜谱之一，以鲈鱼为制作主料，清蒸鲈鱼的烹饪技巧以蒸菜为主，口味属于咸鲜。
          鲈鱼富含多种营养价值，是淡水鱼中含DHA量最高的，因此清蒸鲈鱼最补脑。选用一斤左右的鲈鱼，蒸的时间恰到火候，鱼肉刚熟，细嫩爽滑，鱼肉的鲜美完全的呈现。汤汁带着米酒的甜，豉油的香，吃到嘴里绝对每一口都是享受。
        </p>
        <p slot="gongbaojiding">
          宫爆鸡丁，又称宫保鸡丁，是川菜中最具代表性的菜品之一。创始人为贵州织金人时任四川总督丁宝桢。其在任四川总督时创制该菜，流传下来。由于一般认为宫保鸡丁正式创制是丁宝桢任四川总督之时，在蜀地创制并流传开，且其后的漫长岁月中，宫保鸡丁主要通过市场巨大的川菜馆作为载体走向大江南北及海外，声名远播，因此宫保鸡丁在菜系定位属于川菜系，同时由于丁宝桢为贵州人，所以宫保鸡丁也可被认为是贵州菜系即黔菜系。
        </p>
        <p slot="mapodoufu">
          麻婆豆腐（拼音：má pó dòu fǔ；英文：sauteed tofu in hot and spicy sauce），是四川省传统名菜之一，属于川菜，主料为：豆腐，辅料为：蒜苗、牛肉沫(其他肉也可以)，调料为：豆瓣、辣椒面和花椒面、酱油、生抽、老抽、糖、淀粉等，麻来自花椒，辣来自辣椒面，此菜成菜麻、辣、鲜、香、烫、翠、嫩、酥，将川菜麻辣味型的特点展现的淋漓尽致，如今，麻婆豆腐远渡重洋，在美国、加拿大、英国、法国、越南、新加坡、马来西亚、日本、澳大利亚等国安家落户，从一味家常小菜一跃而登上大雅之堂，成了国际名菜。
        </p>
        <p slot="xihucuyu">
          西湖醋鱼（West Lake Fish in Vinegar Gravy），又名“叔嫂传珍”“宋嫂鱼”，前身为“宋嫂鱼羹”，是中国浙江省杭州市传统风味名菜，为浙江菜系 [1]  。
          西湖醋鱼主以草鱼等食材用料烹制，色泽红亮，肉质鲜嫩，酸甜清香，口感软嫩，带有蟹味 [2]  。
          2018年9月10日，西湖醋鱼被评为浙江省十大经典名菜之一 [3]  。
        </p>
      </xin-tabs>
    </div>
    <div class="line">
      <xin-label>Content 固定高度展示</xin-label>
      <xin-tabs
        :list="list"
        itemValue="name"
        itemLabel="title"
        v-model="active"
        height="100px"
        @tab-change="tabChange"
      >
        <p slot="yuxiangrousi">
          鱼香肉丝（Yuxiang shredded pork），是四川的一道特色名菜，该菜品以泡辣椒、子姜、大蒜、糖和醋炒制猪里脊肉丝而成，由民国时期的一位川菜大厨所创制，相传灵感来自泡椒肉丝。
          鱼香肉丝是一道著名川菜，其咸鲜酸甜兼备，葱姜蒜香浓郁，其味是调味品调制而成，此法源出于四川民间独具特色的烹鱼调味方法，而今已广泛用于川味的熟菜中。
        </p>
        <p slot="songshuguiyu">
          松鼠鳜鱼，又名松鼠桂鱼，为苏帮菜中色香味兼具的代表之作 [1-2]  ，相传乾隆皇帝下江南，微服至苏州松鹤楼菜馆用膳，厨师用鲤鱼出骨，在鱼肉上刻花纹，加调味稍腌后，拖上蛋黄糊，入热油锅嫩炸成熟后，浇上熬热的糖醋卤汁，形状似鼠，外脆里嫩，酸甜可口，乾隆皇帝吃后很满意，后名扬苏州 [3]  。
        </p>
        <p slot="qingzhengluyu">
          清蒸鲈鱼的烹饪技巧以蒸菜为主，口味属于清淡。清蒸鲈鱼是广东省特色传统名菜之一。属于粤菜系，海鲜菜谱之一，以鲈鱼为制作主料，清蒸鲈鱼的烹饪技巧以蒸菜为主，口味属于咸鲜。
          鲈鱼富含多种营养价值，是淡水鱼中含DHA量最高的，因此清蒸鲈鱼最补脑。选用一斤左右的鲈鱼，蒸的时间恰到火候，鱼肉刚熟，细嫩爽滑，鱼肉的鲜美完全的呈现。汤汁带着米酒的甜，豉油的香，吃到嘴里绝对每一口都是享受。
        </p>
        <p slot="gongbaojiding">
          宫爆鸡丁，又称宫保鸡丁，是川菜中最具代表性的菜品之一。创始人为贵州织金人时任四川总督丁宝桢。其在任四川总督时创制该菜，流传下来。由于一般认为宫保鸡丁正式创制是丁宝桢任四川总督之时，在蜀地创制并流传开，且其后的漫长岁月中，宫保鸡丁主要通过市场巨大的川菜馆作为载体走向大江南北及海外，声名远播，因此宫保鸡丁在菜系定位属于川菜系，同时由于丁宝桢为贵州人，所以宫保鸡丁也可被认为是贵州菜系即黔菜系。
        </p>
        <p slot="mapodoufu">
          麻婆豆腐（拼音：má pó dòu fǔ；英文：sauteed tofu in hot and spicy sauce），是四川省传统名菜之一，属于川菜，主料为：豆腐，辅料为：蒜苗、牛肉沫(其他肉也可以)，调料为：豆瓣、辣椒面和花椒面、酱油、生抽、老抽、糖、淀粉等，麻来自花椒，辣来自辣椒面，此菜成菜麻、辣、鲜、香、烫、翠、嫩、酥，将川菜麻辣味型的特点展现的淋漓尽致，如今，麻婆豆腐远渡重洋，在美国、加拿大、英国、法国、越南、新加坡、马来西亚、日本、澳大利亚等国安家落户，从一味家常小菜一跃而登上大雅之堂，成了国际名菜。
        </p>
        <p slot="xihucuyu">
          西湖醋鱼（West Lake Fish in Vinegar Gravy），又名“叔嫂传珍”“宋嫂鱼”，前身为“宋嫂鱼羹”，是中国浙江省杭州市传统风味名菜，为浙江菜系 [1]  。
          西湖醋鱼主以草鱼等食材用料烹制，色泽红亮，肉质鲜嫩，酸甜清香，口感软嫩，带有蟹味 [2]  。
          2018年9月10日，西湖醋鱼被评为浙江省十大经典名菜之一 [3]  。
        </p>
      </xin-tabs>
    </div>
  </div>
</template>

<script>
export default {
  components: {
  },
  data () {
    return {
      active: 'yuxiangrousi',
      list: [
        {name: 'yuxiangrousi', title: '鱼香肉丝'},
        {name: 'songshuguiyu', title: '松鼠鳜鱼'},
        {name: 'qingzhengluyu', title: '清蒸鲈鱼'},
        {name: 'gongbaojiding', title: '宫爆鸡丁'},
        {name: 'mapodoufu', title: '麻婆豆腐'},
        {name: 'xihucuyu', title: '西湖醋鱼'}
      ],
      active1: 2,
      list1: [
        {name: 1, title: '鱼香肉丝'},
        {name: 2, title: '松鼠鳜鱼'}
      ]
    }
  },
  mounted () {
  },
  methods: {
    tabChange (val) {
      this.active = val
      console.log('tabChange 事件: ', val)
    },
    tabChange1 (val) {
      this.active1 = val
      console.log('tabChange 事件: ', val)
    },
    radioChange (val, item) {
      this.radioValue = val
      console.log('radio chage 事件: ', val, item)
    },
    changeEvent (v) {
      console.log('change事件', v)
    }
  }
}
</script>
