<template>
  <div class="example-page">
    <div class="line">
      <xin-label>基础展示（值：{{active}}）</xin-label>
      <xin-tabs
        :list="list"
        itemValue="name"
        itemLabel="title"
        v-model="active"
        @tab-change="tabChange"
      >
        <p slot="baidu">
          百度是拥有强大互联网基础的领先AI公司。百度愿景是：成为最懂用户，并能帮助人们成长的全球顶级高科技公司。 [1] 
          “百度”二字，来自于八百年前南宋词人辛弃疾的一句词：众里寻他千百度。这句话描述了词人对理想的执着追求。1999年底，身在美国硅谷的李彦宏看到了中国互联网及中文搜索引擎服务的巨大发展潜力，抱着技术改变世界的梦想，他毅然辞掉硅谷的高薪工作，携搜索引擎专利技术，于 2000年1月1日在中关村创建了百度公司。
          百度拥有数万名研发工程师，这是中国乃至全球都顶尖的技术团队。这支队伍掌握着世界上最为先进的搜索引擎技术，使百度成为中国掌握世界尖端科学核心技术的中国高科技企业，也使中国成为美国、俄罗斯、和韩国之外，全球仅有的4个拥有搜索引擎核心技术的国家之一。
        </p>
        <p slot="jingdong">
          京东（股票代码：JD），中国自营式电商企业，创始人刘强东担任京东集团董事局主席兼首席执行官 [1]  。旗下设有京东商城、京东金融、拍拍网、京东智能、O2O及海外事业部等。2013年正式获得虚拟运营商牌照。2014年5月在美国纳斯达克证券交易所正式挂牌上市。2015年7月，京东凭借高成长性入选纳斯达克100指数和纳斯达克100平均加权指数。 [2]  2016年6月与沃尔玛达成深度战略合作，1号店并入京东。
          2017年1月4日，中国银联宣布京东金融旗下支付公司正式成为银联收单成员机构。2017年4月25日，京东集团宣布正式组建京东物流子集团。2017年8月3日，2017年“中国互联网企业100强”榜单发布，京东排名第四位。 [3]  2019年7月，发布2019《财富》世界500强：位列139位。 [4] 
          2018年3月15日，京东内部公告成立了“客户卓越体验部”，该部门将整体负责京东集团层面客户体验项目的推进。 [5]  2018年《财富》世界500强排行榜第181名。2018年7月24日，京东增资安联财险中国的方案获得了银保监会的批准。 [6-7]  9月4日，京东集团与如意控股集团签署战略合作协议。 [8]  2019年8月22日，进入2019中国民营企业500强前十名 [9]  ；2019中国民营企业服务业100强发布，京东集团排名第4 [10]  。2019年9月7日，中国商业联合会、中华全国商业信息中心发布2018年度中国零售百强名单，京东排名第2位。 [11-12]  2019年10月，在福布斯全球数字经济100强榜排第44位。
        </p>
        <p slot="tengxun">
          深圳市腾讯计算机系统有限公司成立于1998年11月，由马化腾、张志东、许晨晔、陈一丹、曾李青五位创始人共同创立。
          腾讯多元化的服务包括：社交和通信服务QQ及微信/WeChat、社交网络平台QQ空间、腾讯游戏旗下QQ游戏平台、门户网站腾讯网、腾讯新闻客户端和网络视频服务腾讯视频等。 [1] 
          2004年腾讯公司在香港联交所主板公开上市（股票代号00700），董事会主席兼首席执行官是马化腾。
          2018年6月20日，世界品牌实验室（World Brand Lab）在北京发布了2018年《中国500最具价值品牌》分析报告。腾讯居第二位。2018年12月，世界品牌实验室编制的《2018世界品牌500强》揭晓，排名第39。 [2]  2019年7月，发布2019《财富》世界500强：位列237位。 [3]  2019年8月，入选2019年中国最佳董事会50强。 [4]  2019年9月1日，2019中国服务业企业500强榜单在济南发布，腾讯控股有限公司排名第32位。 [5]  2019年10月，2019福布斯全球数字经济100强榜位列14位。 [6]  2019年10月23日， 2019《财富》未来50强榜单公布，腾讯控股有限公司排名第12。 [7]  “一带一路”中国企业100强榜单排名第14位。 [8]  2019年12月，腾讯入选2019中国品牌强国盛典榜样100品牌。 [9]  2019年12月18日，人民日报发布中国品牌发展指数100榜单，腾讯排名第4位。
        </p>
        <p slot="zijietiaodong">
          北京字节跳动科技有限公司，成立于2012年3月，是最早将人工智能应用于移动互联网场景的科技企业之一，是中国北京的一家信息科技公司，地址位于北京市海淀区知春路甲48号 [1]  。公司以建设“全球创作与交流平台”为愿景 [2]  。字节跳动的全球化布局始于2015年 [3]  ，“技术出海”是字节跳动全球化发展的核心战略 [4]  ，其旗下产品有今日头条，西瓜视频，抖音，火山小视频，皮皮虾，懂车帝，悟空问答等。
          动人工智能实验室成立于2016年 [5]  ，旨在针对人工智能相关领域的长期性和开放性问题进行探索，帮助公司实现对未来发展的构想 [6]  。其独立研发的“今日头条”客户端，通过海量信息采集、深度数据挖掘和用户行为分析，为用户智能推荐个性化信息，从而开创了一种全新的新闻阅读模式 [7]  。
        </p>
        <p slot="alibaba">
          阿里巴巴集团控股有限公司（简称：阿里巴巴集团）是以曾担任英语教师的马云为首的18人于1999年在浙江省杭州市创立的公司。 [1-2] 
          阿里巴巴集团经营多项业务，另外也从关联公司的业务和服务中取得经营商业生态系统上的支援。业务和关联公司的业务包括：淘宝网、天猫、聚划算、全球速卖通、阿里巴巴国际交易市场、1688、阿里妈妈、阿里云、蚂蚁金服、菜鸟网络等。 [3] 
          2014年9月19日，阿里巴巴集团在纽约证券交易所正式挂牌上市，创造了史上最大IPO记录，股票代码“BABA”，创始人为马云。2019年11月26日，阿里巴巴港股上市，总市值超4万亿，登顶港股成为港股“新股王” [4-5]  。
          2019年9月1日，2019中国服务业企业500强榜单在济南发布，阿里巴巴集团控股有限公司排名第24位。 [6]  9月6日，阿里巴巴集团宣布20亿美元全资收购网易考拉，领投网易云音乐7亿美元融资。 [7]  10月，2019福布斯全球数字经济100强榜位列10位。 [8]  10月23日， 2019《财富》未来50强榜单公布，阿里巴巴集团排名第11。 [9]  “一带一路”中国企业100强榜单排名第5位。 [10]  11月16日，胡润研究院发布《2019胡润全球独角兽活跃投资机构百强榜》，阿里巴巴排名第7位。 [11]  12月，阿里巴巴集团入选2019中国品牌强国盛典榜样100品牌。 [12]  2020年1月11日，阿里巴巴宣布其成为鼠年春晚独家电商合作伙伴，并提供电商补贴。
        </p>
        <p slot="pinduoduo">
          拼多多 [1]  是国内移动互联网的主流电子商务应用产品。专注于C2M拼团购物的第三方社交电商平台，成立于2015年9月，用户通过发起和朋友、家人、邻居等的拼团，可以以更低的价格，拼团购买优质商品。
          旨在凝聚更多人的力量，用更低的价格买到更好的东西，体会更多的实惠和乐趣。通过沟通分享形成的社交理念，形成了拼多多独特的新社交电商思维。 [2] 
          2019年12月，拼多多入选2019中国品牌强国盛典榜样100品牌。
        </p>
      </xin-tabs>
    </div>
    <div class="line">
      <xin-label>基础展示（值：{{active1}}）</xin-label>
      <xin-tabs
        :list="list1"
        itemValue="name"
        itemLabel="title"
        v-model="active1"
        @tab-change="tabChange1"
      >
        <p :slot="1">
          Tabs 1
        </p>
        <p :slot="2">
          Tabs 2
        </p>
      </xin-tabs>
    </div>
    <div class="line">
      <xin-label>其他样式展示：蓝色</xin-label>
      <xin-tabs
        :list="list"
        itemValue="name"
        itemLabel="title"
        v-model="active"
        color="info"
        @tab-change="tabChange"
      >
        <p slot="baidu">
          百度是拥有强大互联网基础的领先AI公司。百度愿景是：成为最懂用户，并能帮助人们成长的全球顶级高科技公司。 [1] 
          “百度”二字，来自于八百年前南宋词人辛弃疾的一句词：众里寻他千百度。这句话描述了词人对理想的执着追求。1999年底，身在美国硅谷的李彦宏看到了中国互联网及中文搜索引擎服务的巨大发展潜力，抱着技术改变世界的梦想，他毅然辞掉硅谷的高薪工作，携搜索引擎专利技术，于 2000年1月1日在中关村创建了百度公司。
          百度拥有数万名研发工程师，这是中国乃至全球都顶尖的技术团队。这支队伍掌握着世界上最为先进的搜索引擎技术，使百度成为中国掌握世界尖端科学核心技术的中国高科技企业，也使中国成为美国、俄罗斯、和韩国之外，全球仅有的4个拥有搜索引擎核心技术的国家之一。
        </p>
        <p slot="jingdong">
          京东（股票代码：JD），中国自营式电商企业，创始人刘强东担任京东集团董事局主席兼首席执行官 [1]  。旗下设有京东商城、京东金融、拍拍网、京东智能、O2O及海外事业部等。2013年正式获得虚拟运营商牌照。2014年5月在美国纳斯达克证券交易所正式挂牌上市。2015年7月，京东凭借高成长性入选纳斯达克100指数和纳斯达克100平均加权指数。 [2]  2016年6月与沃尔玛达成深度战略合作，1号店并入京东。
          2017年1月4日，中国银联宣布京东金融旗下支付公司正式成为银联收单成员机构。2017年4月25日，京东集团宣布正式组建京东物流子集团。2017年8月3日，2017年“中国互联网企业100强”榜单发布，京东排名第四位。 [3]  2019年7月，发布2019《财富》世界500强：位列139位。 [4] 
          2018年3月15日，京东内部公告成立了“客户卓越体验部”，该部门将整体负责京东集团层面客户体验项目的推进。 [5]  2018年《财富》世界500强排行榜第181名。2018年7月24日，京东增资安联财险中国的方案获得了银保监会的批准。 [6-7]  9月4日，京东集团与如意控股集团签署战略合作协议。 [8]  2019年8月22日，进入2019中国民营企业500强前十名 [9]  ；2019中国民营企业服务业100强发布，京东集团排名第4 [10]  。2019年9月7日，中国商业联合会、中华全国商业信息中心发布2018年度中国零售百强名单，京东排名第2位。 [11-12]  2019年10月，在福布斯全球数字经济100强榜排第44位。
        </p>
        <p slot="tengxun">
          深圳市腾讯计算机系统有限公司成立于1998年11月，由马化腾、张志东、许晨晔、陈一丹、曾李青五位创始人共同创立。
          腾讯多元化的服务包括：社交和通信服务QQ及微信/WeChat、社交网络平台QQ空间、腾讯游戏旗下QQ游戏平台、门户网站腾讯网、腾讯新闻客户端和网络视频服务腾讯视频等。 [1] 
          2004年腾讯公司在香港联交所主板公开上市（股票代号00700），董事会主席兼首席执行官是马化腾。
          2018年6月20日，世界品牌实验室（World Brand Lab）在北京发布了2018年《中国500最具价值品牌》分析报告。腾讯居第二位。2018年12月，世界品牌实验室编制的《2018世界品牌500强》揭晓，排名第39。 [2]  2019年7月，发布2019《财富》世界500强：位列237位。 [3]  2019年8月，入选2019年中国最佳董事会50强。 [4]  2019年9月1日，2019中国服务业企业500强榜单在济南发布，腾讯控股有限公司排名第32位。 [5]  2019年10月，2019福布斯全球数字经济100强榜位列14位。 [6]  2019年10月23日， 2019《财富》未来50强榜单公布，腾讯控股有限公司排名第12。 [7]  “一带一路”中国企业100强榜单排名第14位。 [8]  2019年12月，腾讯入选2019中国品牌强国盛典榜样100品牌。 [9]  2019年12月18日，人民日报发布中国品牌发展指数100榜单，腾讯排名第4位。
        </p>
        <p slot="zijietiaodong">
          北京字节跳动科技有限公司，成立于2012年3月，是最早将人工智能应用于移动互联网场景的科技企业之一，是中国北京的一家信息科技公司，地址位于北京市海淀区知春路甲48号 [1]  。公司以建设“全球创作与交流平台”为愿景 [2]  。字节跳动的全球化布局始于2015年 [3]  ，“技术出海”是字节跳动全球化发展的核心战略 [4]  ，其旗下产品有今日头条，西瓜视频，抖音，火山小视频，皮皮虾，懂车帝，悟空问答等。
          动人工智能实验室成立于2016年 [5]  ，旨在针对人工智能相关领域的长期性和开放性问题进行探索，帮助公司实现对未来发展的构想 [6]  。其独立研发的“今日头条”客户端，通过海量信息采集、深度数据挖掘和用户行为分析，为用户智能推荐个性化信息，从而开创了一种全新的新闻阅读模式 [7]  。
        </p>
        <p slot="alibaba">
          阿里巴巴集团控股有限公司（简称：阿里巴巴集团）是以曾担任英语教师的马云为首的18人于1999年在浙江省杭州市创立的公司。 [1-2] 
          阿里巴巴集团经营多项业务，另外也从关联公司的业务和服务中取得经营商业生态系统上的支援。业务和关联公司的业务包括：淘宝网、天猫、聚划算、全球速卖通、阿里巴巴国际交易市场、1688、阿里妈妈、阿里云、蚂蚁金服、菜鸟网络等。 [3] 
          2014年9月19日，阿里巴巴集团在纽约证券交易所正式挂牌上市，创造了史上最大IPO记录，股票代码“BABA”，创始人为马云。2019年11月26日，阿里巴巴港股上市，总市值超4万亿，登顶港股成为港股“新股王” [4-5]  。
          2019年9月1日，2019中国服务业企业500强榜单在济南发布，阿里巴巴集团控股有限公司排名第24位。 [6]  9月6日，阿里巴巴集团宣布20亿美元全资收购网易考拉，领投网易云音乐7亿美元融资。 [7]  10月，2019福布斯全球数字经济100强榜位列10位。 [8]  10月23日， 2019《财富》未来50强榜单公布，阿里巴巴集团排名第11。 [9]  “一带一路”中国企业100强榜单排名第5位。 [10]  11月16日，胡润研究院发布《2019胡润全球独角兽活跃投资机构百强榜》，阿里巴巴排名第7位。 [11]  12月，阿里巴巴集团入选2019中国品牌强国盛典榜样100品牌。 [12]  2020年1月11日，阿里巴巴宣布其成为鼠年春晚独家电商合作伙伴，并提供电商补贴。
        </p>
        <p slot="pinduoduo">
          拼多多 [1]  是国内移动互联网的主流电子商务应用产品。专注于C2M拼团购物的第三方社交电商平台，成立于2015年9月，用户通过发起和朋友、家人、邻居等的拼团，可以以更低的价格，拼团购买优质商品。
          旨在凝聚更多人的力量，用更低的价格买到更好的东西，体会更多的实惠和乐趣。通过沟通分享形成的社交理念，形成了拼多多独特的新社交电商思维。 [2] 
          2019年12月，拼多多入选2019中国品牌强国盛典榜样100品牌。
        </p>
      </xin-tabs>
    </div>
    <div class="line">
      <xin-label>Content 固定高度展示</xin-label>
      <xin-tabs
        :list="list"
        itemValue="name"
        itemLabel="title"
        v-model="active"
        height="100px"
        @tab-change="tabChange"
      >
        <p slot="baidu">
          百度是拥有强大互联网基础的领先AI公司。百度愿景是：成为最懂用户，并能帮助人们成长的全球顶级高科技公司。 [1] 
          “百度”二字，来自于八百年前南宋词人辛弃疾的一句词：众里寻他千百度。这句话描述了词人对理想的执着追求。1999年底，身在美国硅谷的李彦宏看到了中国互联网及中文搜索引擎服务的巨大发展潜力，抱着技术改变世界的梦想，他毅然辞掉硅谷的高薪工作，携搜索引擎专利技术，于 2000年1月1日在中关村创建了百度公司。
          百度拥有数万名研发工程师，这是中国乃至全球都顶尖的技术团队。这支队伍掌握着世界上最为先进的搜索引擎技术，使百度成为中国掌握世界尖端科学核心技术的中国高科技企业，也使中国成为美国、俄罗斯、和韩国之外，全球仅有的4个拥有搜索引擎核心技术的国家之一。
        </p>
        <p slot="jingdong">
          京东（股票代码：JD），中国自营式电商企业，创始人刘强东担任京东集团董事局主席兼首席执行官 [1]  。旗下设有京东商城、京东金融、拍拍网、京东智能、O2O及海外事业部等。2013年正式获得虚拟运营商牌照。2014年5月在美国纳斯达克证券交易所正式挂牌上市。2015年7月，京东凭借高成长性入选纳斯达克100指数和纳斯达克100平均加权指数。 [2]  2016年6月与沃尔玛达成深度战略合作，1号店并入京东。
          2017年1月4日，中国银联宣布京东金融旗下支付公司正式成为银联收单成员机构。2017年4月25日，京东集团宣布正式组建京东物流子集团。2017年8月3日，2017年“中国互联网企业100强”榜单发布，京东排名第四位。 [3]  2019年7月，发布2019《财富》世界500强：位列139位。 [4] 
          2018年3月15日，京东内部公告成立了“客户卓越体验部”，该部门将整体负责京东集团层面客户体验项目的推进。 [5]  2018年《财富》世界500强排行榜第181名。2018年7月24日，京东增资安联财险中国的方案获得了银保监会的批准。 [6-7]  9月4日，京东集团与如意控股集团签署战略合作协议。 [8]  2019年8月22日，进入2019中国民营企业500强前十名 [9]  ；2019中国民营企业服务业100强发布，京东集团排名第4 [10]  。2019年9月7日，中国商业联合会、中华全国商业信息中心发布2018年度中国零售百强名单，京东排名第2位。 [11-12]  2019年10月，在福布斯全球数字经济100强榜排第44位。
        </p>
        <p slot="tengxun">
          深圳市腾讯计算机系统有限公司成立于1998年11月，由马化腾、张志东、许晨晔、陈一丹、曾李青五位创始人共同创立。
          腾讯多元化的服务包括：社交和通信服务QQ及微信/WeChat、社交网络平台QQ空间、腾讯游戏旗下QQ游戏平台、门户网站腾讯网、腾讯新闻客户端和网络视频服务腾讯视频等。 [1] 
          2004年腾讯公司在香港联交所主板公开上市（股票代号00700），董事会主席兼首席执行官是马化腾。
          2018年6月20日，世界品牌实验室（World Brand Lab）在北京发布了2018年《中国500最具价值品牌》分析报告。腾讯居第二位。2018年12月，世界品牌实验室编制的《2018世界品牌500强》揭晓，排名第39。 [2]  2019年7月，发布2019《财富》世界500强：位列237位。 [3]  2019年8月，入选2019年中国最佳董事会50强。 [4]  2019年9月1日，2019中国服务业企业500强榜单在济南发布，腾讯控股有限公司排名第32位。 [5]  2019年10月，2019福布斯全球数字经济100强榜位列14位。 [6]  2019年10月23日， 2019《财富》未来50强榜单公布，腾讯控股有限公司排名第12。 [7]  “一带一路”中国企业100强榜单排名第14位。 [8]  2019年12月，腾讯入选2019中国品牌强国盛典榜样100品牌。 [9]  2019年12月18日，人民日报发布中国品牌发展指数100榜单，腾讯排名第4位。
        </p>
        <p slot="zijietiaodong">
          北京字节跳动科技有限公司，成立于2012年3月，是最早将人工智能应用于移动互联网场景的科技企业之一，是中国北京的一家信息科技公司，地址位于北京市海淀区知春路甲48号 [1]  。公司以建设“全球创作与交流平台”为愿景 [2]  。字节跳动的全球化布局始于2015年 [3]  ，“技术出海”是字节跳动全球化发展的核心战略 [4]  ，其旗下产品有今日头条，西瓜视频，抖音，火山小视频，皮皮虾，懂车帝，悟空问答等。
          动人工智能实验室成立于2016年 [5]  ，旨在针对人工智能相关领域的长期性和开放性问题进行探索，帮助公司实现对未来发展的构想 [6]  。其独立研发的“今日头条”客户端，通过海量信息采集、深度数据挖掘和用户行为分析，为用户智能推荐个性化信息，从而开创了一种全新的新闻阅读模式 [7]  。
        </p>
        <p slot="alibaba">
          阿里巴巴集团控股有限公司（简称：阿里巴巴集团）是以曾担任英语教师的马云为首的18人于1999年在浙江省杭州市创立的公司。 [1-2] 
          阿里巴巴集团经营多项业务，另外也从关联公司的业务和服务中取得经营商业生态系统上的支援。业务和关联公司的业务包括：淘宝网、天猫、聚划算、全球速卖通、阿里巴巴国际交易市场、1688、阿里妈妈、阿里云、蚂蚁金服、菜鸟网络等。 [3] 
          2014年9月19日，阿里巴巴集团在纽约证券交易所正式挂牌上市，创造了史上最大IPO记录，股票代码“BABA”，创始人为马云。2019年11月26日，阿里巴巴港股上市，总市值超4万亿，登顶港股成为港股“新股王” [4-5]  。
          2019年9月1日，2019中国服务业企业500强榜单在济南发布，阿里巴巴集团控股有限公司排名第24位。 [6]  9月6日，阿里巴巴集团宣布20亿美元全资收购网易考拉，领投网易云音乐7亿美元融资。 [7]  10月，2019福布斯全球数字经济100强榜位列10位。 [8]  10月23日， 2019《财富》未来50强榜单公布，阿里巴巴集团排名第11。 [9]  “一带一路”中国企业100强榜单排名第5位。 [10]  11月16日，胡润研究院发布《2019胡润全球独角兽活跃投资机构百强榜》，阿里巴巴排名第7位。 [11]  12月，阿里巴巴集团入选2019中国品牌强国盛典榜样100品牌。 [12]  2020年1月11日，阿里巴巴宣布其成为鼠年春晚独家电商合作伙伴，并提供电商补贴。
        </p>
        <p slot="pinduoduo">
          拼多多是国内移动互联网的主流电子商务应用产品。专注于C2M拼团购物的第三方社交电商平台，成立于2015年9月，用户通过发起和朋友、家人、邻居等的拼团，可以以更低的价格，拼团购买优质商品。
          旨在凝聚更多人的力量，用更低的价格买到更好的东西，体会更多的实惠和乐趣。通过沟通分享形成的社交理念，形成了拼多多独特的新社交电商思维。 [2] 
          2019年12月，拼多多入选2019中国品牌强国盛典榜样100品牌。
        </p>
      </xin-tabs>
    </div>
  </div>
</template>

<script>
export default {
  components: {
  },
  data () {
    return {
      active: 'baidu',
      list: [
        {name: 'baidu', title: '百度'},
        {name: 'jingdong', title: '京东'},
        {name: 'tengxun', title: '腾讯'},
        {name: 'zijietiaodong', title: '字节跳动'},
        {name: 'alibaba', title: '阿里巴巴'},
        {name: 'pinduoduo', title: '拼多多'}
      ],
      active1: 2,
      list1: [
        {name: 1, title: '百度'},
        {name: 2, title: '腾讯'}
      ]
    }
  },
  mounted () {
  },
  methods: {
    tabChange (val) {
      this.active = val
      console.log('tabChange 事件: ', val)
    },
    tabChange1 (val) {
      this.active1 = val
      console.log('tabChange 事件: ', val)
    },
    radioChange (val, item) {
      this.radioValue = val
      console.log('radio chage 事件: ', val, item)
    },
    changeEvent (v) {
      console.log('change事件', v)
    }
  }
}
</script>
