<template>
  <div class="page">
    <div class="line">
      <xin-label>基础展示（值：{{active}}）</xin-label>
      <xin-tabs
        :list="list"
        itemValue="name"
        itemLabel="title"
        v-model="active"
        @tab-change="tabChange"
      >
        <p slot="kongJun">
          中国人民解放军空军是以航空兵为主体的军种。进行空中作战、对空作战和从空中对地面
          目标实施攻击的主要军事力量。由航空兵、地空导弹兵、高射炮兵、空降兵、雷达兵、电子
          对抗兵、通信兵等兵种和其他专业勤务部队组成。下辖军区空军和军（空降兵）、院校、
          科研试验等单位。建立有基本适应现代战争需要的作战指挥、教育训练、科研装备和后勤
          保障体系，具有较强的空中进攻作战、防空作战和空运空降力量，担负着维护国家主权、
          保卫祖国领空安全的重大使命。还负有抢险救灾，参加国家社会主义建设的任务 [2]  。
          空军是战略性军种，战略能力要与不断拓展的国家利益和不断变化的安全形势相适应。空军
          在改革强军中深化体系重塑，领导指挥体制、规模结构和力量编成焕然一新；歼-20、运-20、
          歼-16、歼-10C和轰-6K、空警-500，以及红旗-9防空导弹等新型武器装备投入新时代练兵备
          战，加快推进空天战略打击、战略预警、空天防御和战略投送等能力建设；中国空军不断拓展
          国际话语新空间，全力打造制胜空天的体系作战群和主导话语的舆论攻防群，实现硬实力和软
          实力协调发展 [6]  。
        </p>
        <p slot="kongJun">
          中国人民解放军诞生于1927年8月1日，建立之初仅由陆军组成，至2018年已经91周年。它经
          历了中国工农革命军、中国工农红军、八路军和新四军等阶段，在1946年10月改称为中国人
          民解放军。经过十年土地革命战争以后，继续了八年抗日战争，四年解放战争，战胜强大的
          国内外敌人，夺取了中国革命的胜利，做出了巨大的历史贡献。
          中国人民解放军陆军现主要由步兵（摩托化步兵、机械化步兵）、炮兵（地面炮兵、高射炮
          兵）、装甲兵、工程兵、通讯兵、防化兵和侦察兵、电子对抗、汽车兵、测绘兵、气象兵等专
          业部队组成。
          2015年12月31日，中国成立中国人民解放军陆军领导机构。
        </p>
        <p slot="luJun">
          中国人民解放军诞生于1927年8月1日，建立之初仅由陆军组成，至2018年已经91周年。它经
          历了中国工农革命军、中国工农红军、八路军和新四军等阶段，在1946年10月改称为中国人
          民解放军。经过十年土地革命战争以后，继续了八年抗日战争，四年解放战争，战胜强大的
          国内外敌人，夺取了中国革命的胜利，做出了巨大的历史贡献。
          中国人民解放军陆军现主要由步兵（摩托化步兵、机械化步兵）、炮兵（地面炮兵、高射炮
          兵）、装甲兵、工程兵、通讯兵、防化兵和侦察兵、电子对抗、汽车兵、测绘兵、气象兵等专
          业部队组成。
          2015年12月31日，中国成立中国人民解放军陆军领导机构。
        </p>
        <p slot="haiJun">
          中国人民解放军海军（英文：People's Liberation Army Navy，缩写：PLAN或PLA Navy，舰
          艇前缀：CNS-Chinese Naval Ship 或PLANS-PLA Navy Ship），是中华人民共和国的海上武
          装力量，中国人民解放军的海上军种。中国人民解放军海军以舰艇部队和海军航空兵为主体，其
          主要任务是独立或协同陆军、空军防御敌人从海上的入侵，保卫领海主权，维护海洋权益。其作
          战部队——除了海军总部直辖外，分布于北海、东海、南海三支舰队中。海军是海上作战的主力，
          具有在水面、水下、空中作战的能力。
          中国人民解放军海军以新型航空母舰、新型驱逐舰、新型潜艇、新型战斗机为代表的新一代主战装
          备，以及与其相配套的新型导弹、鱼雷、舰炮，电子战装备等武器系统陆续交付使用。人民海军
          已经拥有大型区域防空舰、核动力潜艇、AIP潜艇等世界先进武器装备，中国人民解放军海军航
          空兵现已装备了轰炸机、巡逻机、电子干扰机、水上飞机、运输机等勤务飞机。海防导弹形成系
          列，不仅有岸对舰导弹、舰对舰导弹，还有舰对空导弹、空对舰导弹、空对空导弹等。中国人民
          解放军海军现役军人约24万人，舰船300余艘，飞机600余架，现役舰艇总吨位仅次于美国，是西
          太平洋地区最大规模的海上武装力量。 [1-2]
        </p>
        <p slot="huoJianJun">
          中国人民解放军火箭军是中国人民解放军新的军种，由第二炮兵更名而来，于2015年12月31日正式
          成立，是中国大国地位的战略支撑，是维护国家安全的重要基石。 [1-2] 
          近平向陆军、火箭军、战略支援部队授予军旗并致训词，周亚宁任火箭军司令员，王家胜 [1]  任
          火箭军政治委员 [2]  。
        </p>
        <p slot="houQinJun">
          中国人民解放军联勤保障部队，成立于2016年9月13日，由中央军事委员会直属，总部机关位于武
          汉，以武汉联勤保障基地为建制领导，下属无锡、桂林、西宁、沈阳、郑州5个联勤保障中心。 [1-6] 
          中国人民解放军联勤保障部队是实施联勤保障和战略战役支援保障的主体力量，是中国特色现代军事力
          量体系的重要组成部分。组建中央军委联勤保障部队，标志着具有中国人民解放军特色的现代联勤保障
          体制的正式建立。 [1-2] 
          中国人民解放军联勤保障部队是军队调整改革中新组建的一支部队，直属于中央军委领导，在体制上与
          陆军、海军、空军、火箭军、战略支援部队等平行，为副战区级。 [6-7]
        </p>
      </xin-tabs>
    </div>
    <div class="line">
      <xin-label>基础展示（值：{{active1}}）</xin-label>
      <xin-tabs
        :list="list1"
        itemValue="name"
        itemLabel="title"
        v-model="active1"
        @tab-change="tabChange1"
      >
        <p :slot="1">
          Tabs 1
        </p>
        <p :slot="2">
          Tabs 2
        </p>
      </xin-tabs>
    </div>
    <div class="line">
      <xin-label>其他样式展示：蓝色</xin-label>
      <xin-tabs
        :list="list"
        itemValue="name"
        itemLabel="title"
        v-model="active"
        color="blue"
        @tab-change="tabChange"
      >
        <p slot="kongJun">
          中国人民解放军空军是以航空兵为主体的军种。进行空中作战、对空作战和从空中对地面
          目标实施攻击的主要军事力量。由航空兵、地空导弹兵、高射炮兵、空降兵、雷达兵、电子
          对抗兵、通信兵等兵种和其他专业勤务部队组成。下辖军区空军和军（空降兵）、院校、
          科研试验等单位。建立有基本适应现代战争需要的作战指挥、教育训练、科研装备和后勤
          保障体系，具有较强的空中进攻作战、防空作战和空运空降力量，担负着维护国家主权、
          保卫祖国领空安全的重大使命。还负有抢险救灾，参加国家社会主义建设的任务 [2]  。
          空军是战略性军种，战略能力要与不断拓展的国家利益和不断变化的安全形势相适应。空军
          在改革强军中深化体系重塑，领导指挥体制、规模结构和力量编成焕然一新；歼-20、运-20、
          歼-16、歼-10C和轰-6K、空警-500，以及红旗-9防空导弹等新型武器装备投入新时代练兵备
          战，加快推进空天战略打击、战略预警、空天防御和战略投送等能力建设；中国空军不断拓展
          国际话语新空间，全力打造制胜空天的体系作战群和主导话语的舆论攻防群，实现硬实力和软
          实力协调发展 [6]  。
        </p>
        <p slot="kongJun">
          中国人民解放军诞生于1927年8月1日，建立之初仅由陆军组成，至2018年已经91周年。它经
          历了中国工农革命军、中国工农红军、八路军和新四军等阶段，在1946年10月改称为中国人
          民解放军。经过十年土地革命战争以后，继续了八年抗日战争，四年解放战争，战胜强大的
          国内外敌人，夺取了中国革命的胜利，做出了巨大的历史贡献。
          中国人民解放军陆军现主要由步兵（摩托化步兵、机械化步兵）、炮兵（地面炮兵、高射炮
          兵）、装甲兵、工程兵、通讯兵、防化兵和侦察兵、电子对抗、汽车兵、测绘兵、气象兵等专
          业部队组成。
          2015年12月31日，中国成立中国人民解放军陆军领导机构。
        </p>
        <p slot="luJun">
          中国人民解放军诞生于1927年8月1日，建立之初仅由陆军组成，至2018年已经91周年。它经
          历了中国工农革命军、中国工农红军、八路军和新四军等阶段，在1946年10月改称为中国人
          民解放军。经过十年土地革命战争以后，继续了八年抗日战争，四年解放战争，战胜强大的
          国内外敌人，夺取了中国革命的胜利，做出了巨大的历史贡献。
          中国人民解放军陆军现主要由步兵（摩托化步兵、机械化步兵）、炮兵（地面炮兵、高射炮
          兵）、装甲兵、工程兵、通讯兵、防化兵和侦察兵、电子对抗、汽车兵、测绘兵、气象兵等专
          业部队组成。
          2015年12月31日，中国成立中国人民解放军陆军领导机构。
        </p>
        <p slot="haiJun">
          中国人民解放军海军（英文：People's Liberation Army Navy，缩写：PLAN或PLA Navy，舰
          艇前缀：CNS-Chinese Naval Ship 或PLANS-PLA Navy Ship），是中华人民共和国的海上武
          装力量，中国人民解放军的海上军种。中国人民解放军海军以舰艇部队和海军航空兵为主体，其
          主要任务是独立或协同陆军、空军防御敌人从海上的入侵，保卫领海主权，维护海洋权益。其作
          战部队——除了海军总部直辖外，分布于北海、东海、南海三支舰队中。海军是海上作战的主力，
          具有在水面、水下、空中作战的能力。
          中国人民解放军海军以新型航空母舰、新型驱逐舰、新型潜艇、新型战斗机为代表的新一代主战装
          备，以及与其相配套的新型导弹、鱼雷、舰炮，电子战装备等武器系统陆续交付使用。人民海军
          已经拥有大型区域防空舰、核动力潜艇、AIP潜艇等世界先进武器装备，中国人民解放军海军航
          空兵现已装备了轰炸机、巡逻机、电子干扰机、水上飞机、运输机等勤务飞机。海防导弹形成系
          列，不仅有岸对舰导弹、舰对舰导弹，还有舰对空导弹、空对舰导弹、空对空导弹等。中国人民
          解放军海军现役军人约24万人，舰船300余艘，飞机600余架，现役舰艇总吨位仅次于美国，是西
          太平洋地区最大规模的海上武装力量。 [1-2]
        </p>
        <p slot="huoJianJun">
          中国人民解放军火箭军是中国人民解放军新的军种，由第二炮兵更名而来，于2015年12月31日正式
          成立，是中国大国地位的战略支撑，是维护国家安全的重要基石。 [1-2] 
          近平向陆军、火箭军、战略支援部队授予军旗并致训词，周亚宁任火箭军司令员，王家胜 [1]  任
          火箭军政治委员 [2]  。
        </p>
        <p slot="houQinJun">
          中国人民解放军联勤保障部队，成立于2016年9月13日，由中央军事委员会直属，总部机关位于武
          汉，以武汉联勤保障基地为建制领导，下属无锡、桂林、西宁、沈阳、郑州5个联勤保障中心。 [1-6] 
          中国人民解放军联勤保障部队是实施联勤保障和战略战役支援保障的主体力量，是中国特色现代军事力
          量体系的重要组成部分。组建中央军委联勤保障部队，标志着具有中国人民解放军特色的现代联勤保障
          体制的正式建立。 [1-2] 
          中国人民解放军联勤保障部队是军队调整改革中新组建的一支部队，直属于中央军委领导，在体制上与
          陆军、海军、空军、火箭军、战略支援部队等平行，为副战区级。 [6-7]
        </p>
      </xin-tabs>
    </div>
    <div class="line">
      <xin-label>Content 固定高度展示</xin-label>
      <xin-tabs
        :list="list"
        itemValue="name"
        itemLabel="title"
        v-model="active"
        height="100px"
        @tab-change="tabChange"
      >
        <p slot="kongJun">
          中国人民解放军空军是以航空兵为主体的军种。进行空中作战、对空作战和从空中对地面
          目标实施攻击的主要军事力量。由航空兵、地空导弹兵、高射炮兵、空降兵、雷达兵、电子
          对抗兵、通信兵等兵种和其他专业勤务部队组成。下辖军区空军和军（空降兵）、院校、
          科研试验等单位。建立有基本适应现代战争需要的作战指挥、教育训练、科研装备和后勤
          保障体系，具有较强的空中进攻作战、防空作战和空运空降力量，担负着维护国家主权、
          保卫祖国领空安全的重大使命。还负有抢险救灾，参加国家社会主义建设的任务 [2]  。
          空军是战略性军种，战略能力要与不断拓展的国家利益和不断变化的安全形势相适应。空军
          在改革强军中深化体系重塑，领导指挥体制、规模结构和力量编成焕然一新；歼-20、运-20、
          歼-16、歼-10C和轰-6K、空警-500，以及红旗-9防空导弹等新型武器装备投入新时代练兵备
          战，加快推进空天战略打击、战略预警、空天防御和战略投送等能力建设；中国空军不断拓展
          国际话语新空间，全力打造制胜空天的体系作战群和主导话语的舆论攻防群，实现硬实力和软
          实力协调发展 [6]  。
        </p>
        <p slot="kongJun">
          中国人民解放军诞生于1927年8月1日，建立之初仅由陆军组成，至2018年已经91周年。它经
          历了中国工农革命军、中国工农红军、八路军和新四军等阶段，在1946年10月改称为中国人
          民解放军。经过十年土地革命战争以后，继续了八年抗日战争，四年解放战争，战胜强大的
          国内外敌人，夺取了中国革命的胜利，做出了巨大的历史贡献。
          中国人民解放军陆军现主要由步兵（摩托化步兵、机械化步兵）、炮兵（地面炮兵、高射炮
          兵）、装甲兵、工程兵、通讯兵、防化兵和侦察兵、电子对抗、汽车兵、测绘兵、气象兵等专
          业部队组成。
          2015年12月31日，中国成立中国人民解放军陆军领导机构。
        </p>
        <p slot="luJun">
          中国人民解放军诞生于1927年8月1日，建立之初仅由陆军组成，至2018年已经91周年。它经
          历了中国工农革命军、中国工农红军、八路军和新四军等阶段，在1946年10月改称为中国人
          民解放军。经过十年土地革命战争以后，继续了八年抗日战争，四年解放战争，战胜强大的
          国内外敌人，夺取了中国革命的胜利，做出了巨大的历史贡献。
          中国人民解放军陆军现主要由步兵（摩托化步兵、机械化步兵）、炮兵（地面炮兵、高射炮
          兵）、装甲兵、工程兵、通讯兵、防化兵和侦察兵、电子对抗、汽车兵、测绘兵、气象兵等专
          业部队组成。
          2015年12月31日，中国成立中国人民解放军陆军领导机构。
        </p>
        <p slot="haiJun">
          中国人民解放军海军（英文：People's Liberation Army Navy，缩写：PLAN或PLA Navy，舰
          艇前缀：CNS-Chinese Naval Ship 或PLANS-PLA Navy Ship），是中华人民共和国的海上武
          装力量，中国人民解放军的海上军种。中国人民解放军海军以舰艇部队和海军航空兵为主体，其
          主要任务是独立或协同陆军、空军防御敌人从海上的入侵，保卫领海主权，维护海洋权益。其作
          战部队——除了海军总部直辖外，分布于北海、东海、南海三支舰队中。海军是海上作战的主力，
          具有在水面、水下、空中作战的能力。
          中国人民解放军海军以新型航空母舰、新型驱逐舰、新型潜艇、新型战斗机为代表的新一代主战装
          备，以及与其相配套的新型导弹、鱼雷、舰炮，电子战装备等武器系统陆续交付使用。人民海军
          已经拥有大型区域防空舰、核动力潜艇、AIP潜艇等世界先进武器装备，中国人民解放军海军航
          空兵现已装备了轰炸机、巡逻机、电子干扰机、水上飞机、运输机等勤务飞机。海防导弹形成系
          列，不仅有岸对舰导弹、舰对舰导弹，还有舰对空导弹、空对舰导弹、空对空导弹等。中国人民
          解放军海军现役军人约24万人，舰船300余艘，飞机600余架，现役舰艇总吨位仅次于美国，是西
          太平洋地区最大规模的海上武装力量。 [1-2]
        </p>
        <p slot="huoJianJun">
          中国人民解放军火箭军是中国人民解放军新的军种，由第二炮兵更名而来，于2015年12月31日正式
          成立，是中国大国地位的战略支撑，是维护国家安全的重要基石。 [1-2] 
          近平向陆军、火箭军、战略支援部队授予军旗并致训词，周亚宁任火箭军司令员，王家胜 [1]  任
          火箭军政治委员 [2]  。
        </p>
        <p slot="houQinJun">
          中国人民解放军联勤保障部队，成立于2016年9月13日，由中央军事委员会直属，总部机关位于武
          汉，以武汉联勤保障基地为建制领导，下属无锡、桂林、西宁、沈阳、郑州5个联勤保障中心。 [1-6] 
          中国人民解放军联勤保障部队是实施联勤保障和战略战役支援保障的主体力量，是中国特色现代军事力
          量体系的重要组成部分。组建中央军委联勤保障部队，标志着具有中国人民解放军特色的现代联勤保障
          体制的正式建立。 [1-2] 
          中国人民解放军联勤保障部队是军队调整改革中新组建的一支部队，直属于中央军委领导，在体制上与
          陆军、海军、空军、火箭军、战略支援部队等平行，为副战区级。 [6-7]
        </p>
      </xin-tabs>
    </div>
  </div>
</template>

<script>
export default {
  components: {
  },
  data () {
    return {
      active: 'haiJun',
      list: [
        {name: 'kongJun', title: '空军'},
        {name: 'luJun', title: '陆军'},
        {name: 'haiJun', title: '海军'},
        {name: 'huoJianJun', title: '火箭军'},
        {name: 'houQinJun', title: '后勤军'}
      ],
      active1: 2,
      list1: [
        {name: 1, title: '空军'},
        {name: 2, title: '陆军'}
      ]
    }
  },
  mounted () {
  },
  methods: {
    tabChange (val) {
      this.active = val
      console.log('tabChange 事件: ', val)
    },
    tabChange1 (val) {
      this.active1 = val
      console.log('tabChange 事件: ', val)
    },
    radioChange (val, item) {
      this.radioValue = val
      console.log('radio chage 事件: ', val, item)
    },
    changeEvent (v) {
      console.log('change事件', v)
    }
  }
}
</script>
